#include "info_list_dialog.h"


//===================================================================================================================================================
//	Подключение стандартных библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение сторонних библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QPushButton>
#include <QHBoxLayout>
#include <QVBoxLayout>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================


//===================================================================================================================================================
//	Конструктор и деструктор класса
//===================================================================================================================================================
InfoListDialog::InfoListDialog(QStringList errors_list, QString title, QWidget* parent) : QDialog(parent)
{
	//	Свойства класса
	_errors_list = errors_list;
	_model = new QStringListModel(_errors_list);
	_list_view = new QListView(this);
	_list_view->setModel(_model);

	//	Формирование окна диалога
	this->setWindowFlags(this->windowFlags() & ~Qt::WindowContextHelpButtonHint);
	if (!title.isEmpty()) this->setWindowTitle(title);

	//	Создание кнопки
	QPushButton* ok_button = new QPushButton(QString("OK"));
	ok_button->setDefault(true);
	ok_button->setMinimumSize(80, 24);

	QHBoxLayout* button_layout = new QHBoxLayout();
	button_layout->addStretch();
	button_layout->addWidget(ok_button);

	//	Вывод основной формы
	QVBoxLayout* main_layout = new QVBoxLayout(this);
	main_layout->addWidget(_list_view);
	main_layout->addStretch();
	main_layout->addLayout(button_layout);

	//	Обработка сигналов
	connect(ok_button, &QPushButton::clicked, this, &InfoListDialog::accept);


}

InfoListDialog::~InfoListDialog()
{
	if (_model != nullptr) delete _model;
}
