#ifndef __FLEX_EDITOR_FORM_H__
#define __FLEX_EDITOR_FORM_H__	

//===================================================================================================================================================
//	Подключение стандартных библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение сторонних библиотек
//===================================================================================================================================================
#include <dpc/gui/dialogs/msg_box/MsgBox.h>

//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QMainWindow>
#include <QObject>
#include <QWidget>
#include <QCloseEvent>
#include <QString>
#include <QGraphicsView>
#include <QTreeView>
#include <QModelIndex>
#include <QAction>
#include <QLineEdit>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include <data_model/dc_data_manager.h>
#include <gui/forms/algorithms/custom/Editor/editor_scene.h>
#include <gui/forms/algorithms/custom/dep_parser.h>
//
//
#include "service_manager/service_manager.h"
#include "gui/forms/algorithms/custom/cfc_editor/cfc_scene.h"



//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
class flexEditorForm : public QMainWindow
{
	Q_OBJECT

public:
	//===============================================================================================================================================
	//	Конструктор и деструктор класса
	//===============================================================================================================================================
	flexEditorForm(DcController* device, DcAlgCfc* alg, QWidget* parent = 0);
	~flexEditorForm();

	//===============================================================================================================================================
	//	Открытые методы класса
	//===============================================================================================================================================
    CfcScene* scene() { return _scene; }
    QGraphicsView* graphView() const { return _graph_view; }

    //	EditorScene* Scene() { return _scene; }
	DcAlgCfc* alg() const { return _alg; }
	bool hasError() const { return _hasError; }
	QString errorString() const { return _errorString; }
	bool init();

private:
	//===============================================================================================================================================
	//	Вспомогательные методы класса
	//===============================================================================================================================================
	void setFileName();
    void zoomChange(int flag);

	//===============================================================================================================================================
	//	Методы работы с формой
	//===============================================================================================================================================
    void createTreeView();
    void createToolbar();

private slots:
	//===============================================================================================================================================
	//	Методы обработки сигналов формы
	//===============================================================================================================================================
	void onSaveAction();
    void buttonsChange();
    void treeClicked(const QModelIndex& index);
    void setGridEnable(bool enable);
    void zoomInClicked() { zoomChange(-1); }
    void zoomOutClicked() { zoomChange(1); }
    void zoomDefaultClicked() { zoomChange(0); }
	void DataChange() { _data_changed = true; }
    void addInputs();
    void removeInputs();

protected:
	//===============================================================================================================================================
	//	Перегружаемые методы класса
	//===============================================================================================================================================
    virtual void closeEvent(QCloseEvent* event) override;
	virtual void keyPressEvent(QKeyEvent* event) override;
	virtual void wheelEvent(QWheelEvent* event) override;

signals:
	//===============================================================================================================================================
	//	Сигналы изменения формы
	//===============================================================================================================================================
	void aboutToClose();

private:
	//===============================================================================================================================================
	//	Элементы формы
	//===============================================================================================================================================
	QGraphicsView* _graph_view;
    //EditorScene* _scene;
    CfcScene* _scene;
    QTreeView* _tree_menu;
	QLineEdit* _zoom_edit;
    QAction* _grid_action;
    QAction* _copy_action;
    QAction* _cut_action;
	QAction* _paste_action;
	QAction* _delete_action;
	QAction* _append_connector_action;
	QAction* _remove_connector_action;

	//===============================================================================================================================================
	//	Свойства класса
	//===============================================================================================================================================
	DcController* _device;
	DcAlgCfc* _alg;
	bool _hasError;
	QString _errorString;
	QString _fileName;
	float _scale_factor;
	bool _data_changed;
    // DepCfcParser* _parser;

    ServiceManager* _service_manager;
    CfcAlgService* _cfc_service;

};

#endif // __FLEX_EDITOR_FORM_H__
