#include "title_item.h"


//===================================================================================================================================================
//	Подключение стандартных библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение сторонних библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QFontMetrics>
#include <QAction>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include <gui/dialogs/scene_dialog.h>


//===================================================================================================================================================
//	Конструктор и деструктор класса
//===================================================================================================================================================
TitleItem::TitleItem(QString title, QGraphicsItem* parent) : QGraphicsObject(parent)
{
    //  Свойства класса
    _title = title;
    _title_font = QFont("Arial");
    _title_font.setPixelSize(16);
    _title_font.setBold(true);
    _min_width = 0;
    _menu = new QMenu;
    _menu->addAction("Свойства", this, &TitleItem::ChangeName);

    //  Флаги объекта
    setAcceptHoverEvents(false);
    setAcceptDrops(false);
	setFlag(QGraphicsItem::ItemIsFocusable);
    setFlag(QGraphicsItem::ItemSendsGeometryChanges);
}

TitleItem::~TitleItem()
{
    delete _menu;
}


//===================================================================================================================================================
//	Методы работы со свойствами класса
//===================================================================================================================================================
int TitleItem::Width()
{
    QFontMetrics fm(_title_font);
    return fm.horizontalAdvance(_title);
}

//===================================================================================================================================================
//	Виртуальные методы класса
//===================================================================================================================================================
QRectF TitleItem::boundingRect() const
{
    QFontMetrics fm(_title_font);
    int width = fm.horizontalAdvance(_title) + 10;
    return QRectF(QPointF(0, 0), QSizeF(width, 25));
}

void TitleItem::paint(QPainter* painter, const QStyleOptionGraphicsItem* option, QWidget* widget)
{
    QRectF text_rectangle(boundingRect().topLeft(), QPointF(boundingRect().right(), boundingRect().bottom()));
    painter->setFont(_title_font);
    painter->drawText(text_rectangle, Qt::AlignCenter, _title);

    return;
}

//===================================================================================================================================================
//	Обработка сигналов мышки
//===================================================================================================================================================
void TitleItem::mousePressEvent(QGraphicsSceneMouseEvent* event)
{
    //  Проверка области срабатывания мышки
    if (!shape().contains(event->pos())) {
        event->setAccepted(false);
        return; }

    //  Нажатие правой клавиши
    if (event->buttons() & Qt::RightButton) _menu->exec(event->screenPos());
    QGraphicsItem::mousePressEvent(event);

    return;
}

//===================================================================================================================================================
//  Обработка сигналов меню
//===================================================================================================================================================
void TitleItem::ChangeName()
{
    SceneDialog* dialog = new SceneDialog(_title);
    dialog->exec();
    if (dialog->result() == QDialog::Accepted) {
        _title = dialog->name();
        update(); }
    delete dialog; 
}

