#include "cfc_title.h"


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QFontMetrics>
#include <QAction>
#include <QDebug>
#include <QPoint>


//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "gui/dialogs/scene_dialog.h"


//===================================================================================================================================================
//	Конструктор и деструктор класса
//===================================================================================================================================================
CfcTitle::CfcTitle(const QString& title, QGraphicsItem* parent) : QGraphicsObject(parent)
{
    //  Свойства класса
    _title = title;
    _title_font = QFont("Arial");
    _title_font.setPixelSize(16);
    _title_font.setBold(true);
    QMenu _menu ;
    _menu.addAction("Свойства", this, &CfcTitle::changeName);

    //  Флаги объекта
    setAcceptHoverEvents(false);
    setAcceptDrops(false);
    setFlag(QGraphicsItem::ItemIsFocusable);
    setFlag(QGraphicsItem::ItemSendsGeometryChanges);
}

//===================================================================================================================================================
//	Открытые методы класса
//===================================================================================================================================================
int CfcTitle::width() const
{
    QFontMetrics fm(_title_font);
    return fm.horizontalAdvance(_title) + 10;
}

//===================================================================================================================================================
//	Виртуальные методы класса
//===================================================================================================================================================
QRectF CfcTitle::boundingRect() const
{
    return QRectF(QPointF(0, 0), QSizeF(width(), 25));
}

void CfcTitle::paint(QPainter* painter, const QStyleOptionGraphicsItem* option, QWidget* widget)
{
    QRectF text_rectangle(boundingRect().topLeft(), QPointF(boundingRect().right(), boundingRect().bottom()));
    painter->setFont(_title_font);
    painter->drawText(text_rectangle, Qt::AlignCenter, title());

    return;
}

//===================================================================================================================================================
//	Обработка сигналов мышки
//===================================================================================================================================================
void CfcTitle::mousePressEvent(QGraphicsSceneMouseEvent* event)
{
    //  Проверка области срабатывания мышки
    if (!shape().contains(event->pos())) {
        event->setAccepted(false);
        return; }

    //  Нажатие правой клавиши
    if (event->buttons() == Qt::RightButton)
        _menu.exec(event->screenPos());
    QGraphicsItem::mousePressEvent(event);

    return;
}


//===================================================================================================================================================
//  Обработка сигналов меню
//===================================================================================================================================================
void CfcTitle::changeName()
{
    SceneDialog dialog(_title);
    if (dialog.exec() != QDialog::Accepted)
        return;

    _title = dialog.name();
    emit titleCganged(_title);
    update();

    return;
}
