#ifndef __CFC_PARSER_H__
#define __CFC_PARSER_H__

//===================================================================================================================================================
//	Подключение стандартных библиотек
//===================================================================================================================================================
#include <cstdint>

//===================================================================================================================================================
//	Подключение сторонних библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QObject>
#include <QList>
#include <QString>
#include <QDomDocument>
#include <QPointF>
#include <QSizeF>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "gui/forms/algorithms/custom/cfc_editor/cfc_link.h"
#include "gui/forms/algorithms/custom/cfc_editor/cfc_node.h"


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//  Парсер файлов гибкой логики
//  - Обратная совместимость с предущими версиями
//  - Чтение элементов из XML файла
//  - Запись элементов в XML файл
//  - Работа с новой структурой элементов
//===================================================================================================================================================
class CfcParser : public QObject
{
	Q_OBJECT

public:
	//===============================================================================================================================================
	//	Конструктор и деструктор класса
	//===============================================================================================================================================
    CfcParser();
    CfcParser(QList<CfcNode*> nodes, QList<CfcLink*> links);

	//===============================================================================================================================================
	//	Методы работы со свойствами класса
	//===============================================================================================================================================
    QString fileName() const { return _file_name; }
    void setFileName(const QString& file) { _file_name = file; }
    uint8_t version() const { return _version; }
    void setVersion(uint8_t version) { _version = version; }
    QString title() const { return _title; }
    void setTitle(const QString& title) { _title = title; }
    QList<CfcNode*> nodes() const { return _nodes; }
    QList<CfcLink*> links() const { return _links; }

	//===============================================================================================================================================
	//	Открытые методы класса
	//===============================================================================================================================================
    void setData(QList<CfcNode*> nodes, QList<CfcLink*> links);
    bool loadData(const QString& file_name);
    bool saveData(const QString& file_name);

private:
    //===============================================================================================================================================
    //	Вспомогательные методы класса
    //===============================================================================================================================================
    void init();
    bool deserialize(QDomDocument xml);
    CfcNode* newNode(const QDomNode& xml);
    QDomDocument serialize();
    void linksProcessing(QList<CfcNode*> nodes, QList<CfcLink*> links);

signals:
    //===============================================================================================================================================
    //	Сигналы парсера
    //===============================================================================================================================================
    void infoToLog(const QString& message);
    void warningToLog(const QString& message);
    void errorToLog(const QString& message);

private:
    //===============================================================================================================================================
	//	Свойства класса
	//===============================================================================================================================================
    QString _file_name;                     //  Имя файла гибкой логики
    uint8_t _version;                       //  Версия графического файла
    QString _title;                         //  Заголовок графического файла
    QList<CfcNode*> _nodes;                 //  Список узлов алгоритма
    QList<CfcLink*> _links;                 //  Список связей алгоритма
    int _width;                             //  Ширина сцены по умолчанию
    int _height;                            //  Высота сцены по умолчанию
};

#endif	//	__CFC_PARSER_H__
